talk2_siwg_boost/slides_other_lang.org
#+TITLE:     Using Python With Other languages (Boost and SWIG)
#+AUTHOR:    Siddhant Sanyam
#+EMAIL:     siddhant3s@gmail.com
#+DATE:      2011-09-07 Wed
#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 

#+startup: oddeven

#+startup: beamer
#+LaTeX_CLASS: beamer

#+latex_header: \mode<beamer>{\usetheme{Madrid}}
#+latex_header: \documentclass[8pt]{beamer} 
#+BEAMER_FRAME_LEVEL: 2
* Python With C++
** Why C++ ?
   - Because it is as good as C (well, most of the time)
   - Extending C API is ugly, and terribly confusing
   - Because it is Object Oriented
     - Thus you can think in OOP
     - Resembles Python (the OO part)
   - It is more powerfull as a language
   - Offers competitive performance as C
   - Because of Boost (wait till I introduce you to it)
** What can be done with Python and C++ ?
   - Same stuff you can do with C but more
   - You can have class abstractions
   - Extending Python with C++
   - Embedding Python in C++
   - Python is more close to C++ than to C
** Available options to extend Python with C++
   There are multiple options that are available to extend Python with C++
   - Using the ever-friendly Python C API
   - Boost's API for C++
   - SWIG
     Let's take each one of them one by one
** Extending Python with C++ Using Python C API
   - Basic idea is that since C++ is essential ``C with Classes", we can use C++ as C and use the Python C API
   - But that sucks! ... at multiple levels
     - You have to deal with the ugly API and you miss the comfort of Boost and SWIG
     - You are using C++ as C, so no classes and objects, why not use C then?
     - For simple cases when you want to enjoy C++ as a language (with STL and all), it makes sense
     - But you can't expose the class-like interface of C++
   - When will you use it?
     Almost never. Why? Because there are superior alternative available
* Extending C++ using Boost.Python
** Introduction to Boost.Python
  So basically, it is a wrapper class on the Python C API
  It's awesome
  - Because it is easy to use (majorly because of the syntax)
  - You can expose the class interface of C++ with this
  - Great for small to medium sized projects
  - It does operator overloading too!
  - Inheritance is also supported
  - In short, it brings C++ almost completely to Python
** Boost.Python kickstart
   We assume that you have Boost.Python installed on your system.
   - Boost.Python also works without installing it, although it is recommended that you do install it.
   - Boost.Python requires you to include a simple header file <boost/python.hpp>
   - We'll be basically writing Python modules using C++
** Compiling and Build process
   You have many options to build and compile Boost
   - bjam, the recommended way of building Boost
   - mannually linking and compiling using g++
   We'll assume g++ to be de facto standard compiler. Python 2.4 and above is recommended.
   
** Hello Boost!
   Our purpose is to write a module =hello= which has a function called =say=
   - We'll writing the definiation of the function =say= in C++
   - Then we'll use Boost.Python to expose the function in a module called =hello=
   - It's similar stuff we did with Python C API, but I think you'll appreciate the neatness.
