talk2_siwg_boost/slides_other_lang.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Using Python With Other languages (Boost and SWIG)</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-09-07 Wed"/>
<meta name="author" content="Siddhant Sanyam"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">Using Python With Other languages (Boost and SWIG)</h1>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Python With C++ </a>
<ul>
<li><a href="#sec-1_1">Why C++ ? </a></li>
<li><a href="#sec-1_2">What can be done with Python and C++ ? </a></li>
<li><a href="#sec-1_3">Available options to extend Python with C++ </a></li>
<li><a href="#sec-1_4">Extending Python with C++ Using Python C API </a></li>
</ul>
</li>
<li><a href="#sec-2">Extending C++ using Boost.Python </a>
<ul>
<li><a href="#sec-2_1">Introduction to Boost.Python </a></li>
<li><a href="#sec-2_2">Boost.Python kickstart </a></li>
<li><a href="#sec-2_3">Compiling and Build process </a></li>
<li><a href="#sec-2_4">Hello Boost! </a></li>
<li><a href="#sec-2_5">Here is the code for <code>say</code> </a></li>
<li><a href="#sec-2_6">The Boost's Magic </a></li>
<li><a href="#sec-2_7">Compile and Go </a></li>
<li><a href="#sec-2_8">Now that's cool, but what about higher stuff? </a></li>
<li><a href="#sec-2_9">Examples </a></li>
</ul>
</li>
<li><a href="#sec-3">Extending Python with C and C++ using SWIG </a>
<ul>
<li><a href="#sec-3_1">SWIG </a></li>
<li><a href="#sec-3_2">Advantage of SWIG </a></li>
<li><a href="#sec-3_3">How does it work for Python </a></li>
<li><a href="#sec-3_4">SWIG kickstart </a></li>
<li><a href="#sec-3_5">Hello SWIG </a></li>
<li><a href="#sec-3_6">The definition </a></li>
<li><a href="#sec-3_7">Using in a C program </a></li>
<li><a href="#sec-3_8">This was C, let's make it Pythonable </a></li>
<li><a href="#sec-3_9">hello.i </a></li>
<li><a href="#sec-3_10">Let it SWIG </a></li>
<li><a href="#sec-3_11">Lock and load </a></li>
<li><a href="#sec-3_12">Using Module </a></li>
<li><a href="#sec-3_13">First thing first, writing the C++ code </a></li>
<li><a href="#sec-3_14">The interface file </a></li>
<li><a href="#sec-3_15">Implementation file for Point </a></li>
<li><a href="#sec-3_16">Using this Library in C++ (normally) </a></li>
<li><a href="#sec-3_17">Now time for it to be eaten by Python </a></li>
<li><a href="#sec-3_18">Compiling the resultant files </a></li>
<li><a href="#sec-3_19">Run the module </a></li>
<li><a href="#sec-3_20">SWIG Examples </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2"></span> Python With C++ </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3"></span> Why C++ ? </h3>
<div class="outline-text-3" id="text-1_1">

<ul>
<li>Because it is as good as C (well, most of the time)
</li>
<li>Extending C API is ugly, and terribly confusing
</li>
<li>Because it is Object Oriented
<ul>
<li>Thus you can think in OOP
</li>
<li>Resembles Python (the OO part)
</li>
</ul>

</li>
<li>It is more powerfull as a language
</li>
<li>Offers competitive performance as C
</li>
<li>Because of Boost (wait till I introduce you to it)
</li>
</ul>

</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2"><span class="section-number-3"></span> What can be done with Python and C++ ? </h3>
<div class="outline-text-3" id="text-1_2">

<ul>
<li>Same stuff you can do with C but more
</li>
<li>You can have class abstractions
</li>
<li>Extending Python with C++
</li>
<li>Embedding Python in C++
</li>
<li>Python is more close to C++ than to C
</li>
</ul>

</div>

</div>

<div id="outline-container-1_3" class="outline-3">
<h3 id="sec-1_3"><span class="section-number-3"></span> Available options to extend Python with C++ </h3>
<div class="outline-text-3" id="text-1_3">

<p>   There are multiple options that are available to extend Python with C++
</p><ul>
<li>Using the ever-friendly Python C API
</li>
<li>Boost's API for C++
</li>
<li>SWIG
     Let's take each one of them one by one
</li>
</ul>

</div>

</div>

<div id="outline-container-1_4" class="outline-3">
<h3 id="sec-1_4"><span class="section-number-3"></span> Extending Python with C++ Using Python C API </h3>
<div class="outline-text-3" id="text-1_4">

<ul>
<li>Basic idea is that since C++ is essential ``C with Classes", we can use C++ as C and use the Python C API
</li>
<li>But that sucks! &hellip; at multiple levels
<ul>
<li>You have to deal with the ugly API and you miss the comfort of Boost and SWIG
</li>
<li>You are using C++ as C, so no classes and objects, why not use C then?
</li>
<li>For simple cases when you want to enjoy C++ as a language (with STL and all), it makes sense
</li>
<li>But you can't expose the class-like interface of C++
</li>
</ul>

</li>
<li>When will you use it?
     Almost never. Why? Because there are superior alternative available
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2"></span> Extending C++ using Boost.Python </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3"></span> Introduction to Boost.Python </h3>
<div class="outline-text-3" id="text-2_1">

<p>  So basically, it is a wrapper class on the Python C API
  It's awesome
</p><ul>
<li>Because it is easy to use (majorly because of the syntax)
</li>
<li>You can expose the class interface of C++ with this
</li>
<li>Great for small to medium sized projects
</li>
<li>It does operator overloading too!
</li>
<li>Inheritance is also supported
</li>
<li>In short, it brings C++ almost completely to Python
</li>
</ul>

</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3"></span> Boost.Python kickstart </h3>
<div class="outline-text-3" id="text-2_2">

<p>   We assume that you have Boost.Python installed on your system.
</p><ul>
<li>Boost.Python also works without installing it, although it is recommended that you do install it.
</li>
<li>Boost.Python requires you to include a simple header file &lt;boost/python.hpp&gt;
</li>
<li>We'll be basically writing Python modules using C++
</li>
</ul>

</div>

</div>

<div id="outline-container-2_3" class="outline-3">
<h3 id="sec-2_3"><span class="section-number-3"></span> Compiling and Build process </h3>
<div class="outline-text-3" id="text-2_3">

<p>   You have many options to build and compile Boost
</p><ul>
<li>bjam, the recommended way of building Boost
</li>
<li>mannually linking and compiling using g++
</li>
</ul>

<p>   We'll assume g++ to be de facto standard compiler. Python 2.4 and above is recommended.
</p>
</div>

</div>

<div id="outline-container-2_4" class="outline-3">
<h3 id="sec-2_4"><span class="section-number-3"></span> Hello Boost! </h3>
<div class="outline-text-3" id="text-2_4">

<p>   Our purpose is to write a module <code>hello</code> which has a function called <code>say</code>
</p><ul>
<li>We'll writing the definiation of the function <code>say</code> in C++
</li>
<li>Then we'll use Boost.Python to expose the function in a module called <code>hello</code>
</li>
<li>It's similar stuff we did with Python C API, but I think you'll appreciate the neatness.
</li>
</ul>

</div>

</div>
