talk2_siwg_boost/slides_other_lang.tex
% Created 2011-09-16 Fri 15:30
\documentclass{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\mode<beamer>{\usetheme{Madrid}}
\documentclass[8pt]{beamer} 
\providecommand{\alert}[1]{\textbf{#1}}

\title{Using Python With Other languages (Boost and SWIG)}
\author{Siddhant Sanyam}
\date{2011-09-07 Wed}

\begin{document}

\maketitle

\begin{frame}
\frametitle{Outline}
\setcounter{tocdepth}{3}
\tableofcontents
\end{frame}



\section{Python With C++}
\label{sec-1}
\begin{frame}
\frametitle{Why C++ ?}
\label{sec-1_1}


\begin{itemize}
\item Because it is as good as C (well, most of the time)
\item Extending C API is ugly, and terribly confusing
\item Because it is Object Oriented
\begin{itemize}
\item Thus you can think in OOP
\item Resembles Python (the OO part)
\end{itemize}
\item It is more powerfull as a language
\item Offers competitive performance as C
\item Because of Boost (wait till I introduce you to it)
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{What can be done with Python and C++ ?}
\label{sec-1_2}


\begin{itemize}
\item Same stuff you can do with C but more
\item You can have class abstractions
\item Extending Python with C++
\item Embedding Python in C++
\item Python is more close to C++ than to C
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Available options to extend Python with C++}
\label{sec-1_3}

   There are multiple options that are available to extend Python with C++

\begin{itemize}
\item Using the ever-friendly Python C API
\item Boost's API for C++
\item SWIG
     Let's take each one of them one by one
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Extending Python with C++ Using Python C API}
\label{sec-1_4}


\begin{itemize}
\item Basic idea is that since C++ is essential ``C with Classes'', we can use C++ as C and use the Python C API
\item But that sucks! \ldots{} at multiple levels
\begin{itemize}
\item You have to deal with the ugly API and you miss the comfort of Boost and SWIG
\item You are using C++ as C, so no classes and objects, why not use C then?
\item For simple cases when you want to enjoy C++ as a language (with STL and all), it makes sense
\item But you can't expose the class-like interface of C++
\end{itemize}
\item When will you use it?
     Almost never. Why? Because there are superior alternative available
\end{itemize}
\end{frame}
\section{Extending C++ using Boost.Python}
\label{sec-2}
\begin{frame}
\frametitle{Introduction to Boost.Python}
\label{sec-2_1}

  So basically, it is a wrapper class on the Python C API
  It's awesome

\begin{itemize}
\item Because it is easy to use (majorly because of the syntax)
\item You can expose the class interface of C++ with this
\item Great for small to medium sized projects
\item It does operator overloading too!
\item Inheritance is also supported
\item In short, it brings C++ almost completely to Python
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Boost.Python kickstart}
\label{sec-2_2}

   We assume that you have Boost.Python installed on your system.

\begin{itemize}
\item Boost.Python also works without installing it, although it is recommended that you do install it.
\item Boost.Python requires you to include a simple header file <boost/python.hpp>
\item We'll be basically writing Python modules using C++
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Compiling and Build process}
\label{sec-2_3}

   You have many options to build and compile Boost

\begin{itemize}
\item bjam, the recommended way of building Boost
\item mannually linking and compiling using g++
\end{itemize}
   We'll assume g++ to be de facto standard compiler. Python 2.4 and above is recommended.
   
\end{frame}
\begin{frame}
\frametitle{Hello Boost!}
\label{sec-2_4}

   Our purpose is to write a module \texttt{hello} which has a function called \texttt{say}

\begin{itemize}
\item We'll writing the definiation of the function \texttt{say} in C++
\item Then we'll use Boost.Python to expose the function in a module called \texttt{hello}
\item It's similar stuff we did with Python C API, but I think you'll appreciate the neatness.
\end{itemize}
\end{frame}
