talk2_siwg_boost/slides_other_lang.org
** Here is the code for =say=
   =say= takes one =unsigned int= as an arguement and returns `Hello', 'Boost.Python' or 
   'World' depending on if the =int= passed was 0, 1 or 2.
   Definition of =say=
     #+BEGIN_SRC c++ -n
     char const* say(unsigned x)
     {
       static char const* const msgs[] = { "Hello", "Boost.Python", "World!" };
     
       if (x > 2) 
	 throw std::range_error("say: index out of range");
     
       return msgs[x];
     }
     
     #+END_SRC
   - Simple enough right?
   - Well, writing C++ is always the simple part, the important part is making a module out of it.
** The Boost's Magic
   Tuns out that to write the module =hello= and putting function =say= in it is pretty easy in Boost.Python
  #+BEGIN_SRC c++  -n 
     #include <boost/python.hpp>
     using namespace boost::python;
     BOOST_PYTHON_MODULE(hello)
     {
       def("say", //the name of the function to be exposed in Python
	   say,   //the function name in c++
	   "return one of 3 part of Hello Boost.Python World"); //a small description of function for the help function
     }
     
  #+END_SRC
   That's it!
   - Now you know what is meant by ``easy to use"
** Compile and Go
   As I said there are multiple way to compile and go. Easiest is through bjam
   Just execute the command
   : bjam --tools-set
   
** Now that's cool, but what about higher stuff?
   - We'll take each example file one by one
   - Please use a text editor with Line numbering because we'll be using the line numbers to reference examples
** Examples
   - Exposing Classes
   - Operator Overloading
   - Inheritance
   - Virtual Function
   - Serialization
   - Object coversion
* Extending Python with C and C++ using SWIG
** SWIG
   It's a wrapper and interface writer for C/C++
   It means
   - You write C or C++ code, and this tool will write the interface and wrapper to other languages for your code.
   - It supports many languages like Python, Tcl, Ruby, Guile, and Java
   - It supports nearly every feature of C++
   - Usually it offers a neat distinction betwen the original code and the interface (thus you don't have to modify your orignal sources much)
** Advantage of SWIG
   - It's a uniform over different language
   - Hence it is awesome way to have wrappers for your C++ library.
   - It's much more complete to cover features of C++
   - If your interface is in separate file, writing SWIG interface is trivial.
   - It requires none or very less change in your original source code.
** How does it work for Python
   - You first write your C/C++ interface and definition
   - You write a dot i file (example.i) which specifies the interface of the wrapper
   - Use SWIG to generate wrapper files of Python
   - Compiler C/C++ code to a shared library
   - Use your freshly baked module.
** SWIG kickstart
   - You should be having SWIG installed, Python installed.
   - You optionally would like to have a c++ compiler installed :P
   - We'll be using our beloved GNU's GCC in examples.
** Hello SWIG
   First create the C part
   Header file/Interface file

     #+BEGIN_SRC c -n
       /*hello.h*/
       
       /*Signature, Prototype, Definition of the function*/
       int factorial(int n);
       
       
     #+END_SRC
   
