talk2_siwg_boost/slides_other_lang.html

<div id="outline-container-2_5" class="outline-3">
<h3 id="sec-2_5"><span class="section-number-3"></span> Here is the code for <code>say</code> </h3>
<div class="outline-text-3" id="text-2_5">

<p>   <code>say</code> takes one <code>unsigned int</code> as an arguement and returns `Hello', 'Boost.Python' or 
   'World' depending on if the <code>int</code> passed was 0, 1 or 2.
   Definition of <code>say</code>
</p>


<pre class="src src-c++"><span class="linenr"> 1:  </span><span style="color: #00cd00;">char</span> <span style="color: #00cdcd; font-weight: bold;">const</span>* <span style="color: #0000ee; font-weight: bold;">say</span>(<span style="color: #00cd00;">unsigned</span> <span style="color: #cdcd00;">x</span>)
<span class="linenr"> 2:  </span>{
<span class="linenr"> 3:  </span>  <span style="color: #00cdcd; font-weight: bold;">static</span> <span style="color: #00cd00;">char</span> <span style="color: #00cdcd; font-weight: bold;">const</span>* <span style="color: #00cdcd; font-weight: bold;">const</span> msgs[] = { <span style="color: #00cd00;">"Hello"</span>, <span style="color: #00cd00;">"Boost.Python"</span>, <span style="color: #00cd00;">"World!"</span> };
<span class="linenr"> 4:  </span>
<span class="linenr"> 5:  </span>  <span style="color: #00cdcd; font-weight: bold;">if</span> (x &gt; 2) 
<span class="linenr"> 6:  </span>    <span style="color: #00cdcd; font-weight: bold;">throw</span> <span style="color: #cd00cd;">std</span>::range_error(<span style="color: #00cd00;">"say: index out of range"</span>);
<span class="linenr"> 7:  </span>
<span class="linenr"> 8:  </span>  <span style="color: #00cdcd; font-weight: bold;">return</span> msgs[x];
<span class="linenr"> 9:  </span>}
<span class="linenr">10:  </span>
</pre>


<ul>
<li>Simple enough right?
</li>
<li>Well, writing C++ is always the simple part, the important part is making a module out of it.
</li>
</ul>

</div>

</div>

<div id="outline-container-2_6" class="outline-3">
<h3 id="sec-2_6"><span class="section-number-3"></span> The Boost's Magic </h3>
<div class="outline-text-3" id="text-2_6">

<p>   Tuns out that to write the module <code>hello</code> and putting function <code>say</code> in it is pretty easy in Boost.Python
</p>


<pre class="src src-c++"><span class="linenr">1:  </span><span style="color: #0000ee; font-weight: bold;">#include</span> <span style="color: #00cd00;">&lt;boost/python.hpp&gt;</span>
<span class="linenr">2:  </span><span style="color: #00cdcd; font-weight: bold;">using</span> <span style="color: #00cdcd; font-weight: bold;">namespace</span> <span style="color: #cd00cd;">boost</span>::<span style="color: #cd00cd;">python</span>;
<span class="linenr">3:  </span><span style="color: #0000ee; font-weight: bold;">BOOST_PYTHON_MODULE</span>(hello)
<span class="linenr">4:  </span>{
<span class="linenr">5:  </span>  def(<span style="color: #00cd00;">"say"</span>, <span style="color: #cd0000;">//</span>the name of the function to be exposed in Python
<span class="linenr">6:  </span>      say,   <span style="color: #cd0000;">//</span>the function name in c++
<span class="linenr">7:  </span>      <span style="color: #00cd00;">"return one of 3 part of Hello Boost.Python World"</span>); <span style="color: #cd0000;">//</span>a small description of function for the help function
<span class="linenr">8:  </span>}
<span class="linenr">9:  </span>
</pre>


<p>
   That's it!
</p><ul>
<li>Now you know what is meant by ``easy to use"
</li>
</ul>

</div>

</div>

<div id="outline-container-2_7" class="outline-3">
<h3 id="sec-2_7"><span class="section-number-3"></span> Compile and Go </h3>
<div class="outline-text-3" id="text-2_7">

<p>   As I said there are multiple way to compile and go. Easiest is through bjam
   Just execute the command
</p><pre class="example">
bjam --tools-set
</pre>


</div>

</div>

<div id="outline-container-2_8" class="outline-3">
<h3 id="sec-2_8"><span class="section-number-3"></span> Now that's cool, but what about higher stuff? </h3>
<div class="outline-text-3" id="text-2_8">

<ul>
<li>We'll take each example file one by one
</li>
<li>Please use a text editor with Line numbering because we'll be using the line numbers to reference examples
</li>
</ul>

</div>

</div>

<div id="outline-container-2_9" class="outline-3">
<h3 id="sec-2_9"><span class="section-number-3"></span> Examples </h3>
<div class="outline-text-3" id="text-2_9">

<ul>
<li>Exposing Classes
</li>
<li>Operator Overloading
</li>
<li>Inheritance
</li>
<li>Virtual Function
</li>
<li>Serialization
</li>
<li>Object coversion
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2"></span> Extending Python with C and C++ using SWIG </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3"></span> SWIG </h3>
<div class="outline-text-3" id="text-3_1">

<p>   It's a wrapper and interface writer for C/C++
   It means
</p><ul>
<li>You write C or C++ code, and this tool will write the interface and wrapper to other languages for your code.
</li>
<li>It supports many languages like Python, Tcl, Ruby, Guile, and Java
</li>
<li>It supports nearly every feature of C++
</li>
<li>Usually it offers a neat distinction betwen the original code and the interface (thus you don't have to modify your orignal sources much)
</li>
</ul>

</div>

</div>

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3"></span> Advantage of SWIG </h3>
<div class="outline-text-3" id="text-3_2">

<ul>
<li>It's a uniform over different language
</li>
<li>Hence it is awesome way to have wrappers for your C++ library.
</li>
<li>It's much more complete to cover features of C++
</li>
<li>If your interface is in separate file, writing SWIG interface is trivial.
</li>
<li>It requires none or very less change in your original source code.
</li>
</ul>

</div>

</div>

<div id="outline-container-3_3" class="outline-3">
<h3 id="sec-3_3"><span class="section-number-3"></span> How does it work for Python </h3>
<div class="outline-text-3" id="text-3_3">

<ul>
<li>You first write your C/C++ interface and definition
</li>
<li>You write a dot i file (example.i) which specifies the interface of the wrapper
</li>
<li>Use SWIG to generate wrapper files of Python
</li>
<li>Compiler C/C++ code to a shared library
</li>
<li>Use your freshly baked module.
</li>
</ul>

</div>

</div>

<div id="outline-container-3_4" class="outline-3">
<h3 id="sec-3_4"><span class="section-number-3"></span> SWIG kickstart </h3>
<div class="outline-text-3" id="text-3_4">

<ul>
<li>You should be having SWIG installed, Python installed.
</li>
<li>You optionally would like to have a c++ compiler installed :P
</li>
<li>We'll be using our beloved GNU's GCC in examples.
</li>
</ul>

</div>

</div>

<div id="outline-container-3_5" class="outline-3">
<h3 id="sec-3_5"><span class="section-number-3"></span> Hello SWIG </h3>
<div class="outline-text-3" id="text-3_5">

<p>   First create the C part
   Header file/Interface file
</p>



<pre class="src src-c"><span class="linenr">1:  </span><span style="color: #cd0000;">/*</span>hello.h<span style="color: #cd0000;">*/</span>
<span class="linenr">2:  </span>
<span class="linenr">3:  </span><span style="color: #cd0000;">/*</span>Signature, Prototype, Definition of the function<span style="color: #cd0000;">*/</span>
<span class="linenr">4:  </span><span style="color: #00cd00;">int</span> <span style="color: #0000ee; font-weight: bold;">factorial</span>(<span style="color: #00cd00;">int</span> <span style="color: #cdcd00;">n</span>);
<span class="linenr">5:  </span>
<span class="linenr">6:  </span>
</pre>



</div>

</div>
