talk2_siwg_boost/slides_other_lang.tex
\begin{frame}[fragile]
\frametitle{Here is the code for \texttt{say}}
\label{sec-2_5}

   \texttt{say} takes one \texttt{unsigned int} as an arguement and returns `Hello', `Boost.Python' or 
   `World' depending on if the \texttt{int} passed was 0, 1 or 2.
   Definition of \texttt{say}
\begin{verbatim}
1:  char const* say(unsigned x)
2:  {
3:    static char const* const msgs[] = { "Hello", "Boost.Python", "World!" };
4:  
5:    if (x > 2) 
6:      throw std::range_error("say: index out of range");
7:  
8:    return msgs[x];
9:  }
\end{verbatim}

\begin{itemize}
\item Simple enough right?
\item Well, writing C++ is always the simple part, the important part is making a module out of it.
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{The Boost's Magic}
\label{sec-2_6}

   Tuns out that to write the module \texttt{hello} and putting function \texttt{say} in it is pretty easy in Boost.Python
\begin{verbatim}
1:  #include <boost/python.hpp>
2:  using namespace boost::python;
3:  BOOST_PYTHON_MODULE(hello)
4:  {
5:    def("say", //the name of the function to be exposed in Python
6:        say,   //the function name in c++
7:        "return one of 3 part of Hello Boost.Python World"); //a small description of function for the help function
8:  }
\end{verbatim}
   That's it!

\begin{itemize}
\item Now you know what is meant by ``easy to use''
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{Compile and Go}
\label{sec-2_7}

   As I said there are multiple way to compile and go. Easiest is through bjam
   Just execute the command
\begin{verbatim}
    bjam --tools-set
\end{verbatim}

   
\end{frame}
\begin{frame}
\frametitle{Now that's cool, but what about higher stuff?}
\label{sec-2_8}


\begin{itemize}
\item We'll take each example file one by one
\item Please use a text editor with Line numbering because we'll be using the line numbers to reference examples
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Examples}
\label{sec-2_9}


\begin{itemize}
\item Exposing Classes
\item Operator Overloading
\item Inheritance
\item Virtual Function
\item Serialization
\item Object coversion
\end{itemize}
\end{frame}
\section{Extending Python with C and C++ using SWIG}
\label{sec-3}
\begin{frame}
\frametitle{SWIG}
\label{sec-3_1}

   It's a wrapper and interface writer for C/C++
   It means

\begin{itemize}
\item You write C or C++ code, and this tool will write the interface and wrapper to other languages for your code.
\item It supports many languages like Python, Tcl, Ruby, Guile, and Java
\item It supports nearly every feature of C++
\item Usually it offers a neat distinction betwen the original code and the interface (thus you don't have to modify your orignal sources much)
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Advantage of SWIG}
\label{sec-3_2}


\begin{itemize}
\item It's a uniform over different language
\item Hence it is awesome way to have wrappers for your C++ library.
\item It's much more complete to cover features of C++
\item If your interface is in separate file, writing SWIG interface is trivial.
\item It requires none or very less change in your original source code.
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{How does it work for Python}
\label{sec-3_3}


\begin{itemize}
\item You first write your C/C++ interface and definition
\item You write a dot i file (example.i) which specifies the interface of the wrapper
\item Use SWIG to generate wrapper files of Python
\item Compiler C/C++ code to a shared library
\item Use your freshly baked module.
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{SWIG kickstart}
\label{sec-3_4}


\begin{itemize}
\item You should be having SWIG installed, Python installed.
\item You optionally would like to have a c++ compiler installed :P
\item We'll be using our beloved GNU's GCC in examples.
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{Hello SWIG}
\label{sec-3_5}

   First create the C part
   Header file/Interface file

\begin{verbatim}
1:  /*hello.h*/
2:  
3:  /*Signature, Prototype, Definition of the function*/
4:  int factorial(int n);
\end{verbatim}
   
\end{frame}
