talk2_siwg_boost/slides_other_lang.org
** The definition
   Now we'll write the definition of our function
   #+BEGIN_SRC c -n 
     /* hello.c */
     /* Definition of factorial */
     #include "hello.h"
     int factorial(int n) {
       if (n < 0){ 
	 return 0; // Hmm, we're treating this error case
       }
       if (n == 0) {
	 return 1;
       }
       else {
	 return n * factorial(n-1);
       }
     }
     
   #+END_SRC
** Using in a C program
   This is how the main file will use this library in your  typical C program
#+BEGIN_SRC c -n
  #include <stdio.h>
  #include "hello.h"
  
  int main(void)
  {
    int a = 5;
    printf("%i", factorial(a) );
  }
#+END_SRC
   And then you compile it with hello.c
   : gcc main.c hello.c -o hello_executable
   : ./hello_executable
** This was C, let's make it Pythonable
    - You will appreciate the simplicity of SWIG.
    - Our C interface is already done.
    - We'll just write a SWIG's .i file to expose the interface to SWIG
** hello.i
     #+BEGIN_SRC c
       /* File: hello.i */
       %module hello
        /*
          The following blocks are included as is in the wrapper file
          Important to include the interface file in wrapper file
          because the input file is just used for generating the wrapper code
        */
       
       %{
       #include "hello.h"
       %}
       /*
         We'll now declare the interface for the wrapper file.
         At worst case, we can simply #include "hello.h" again
       */
       int factorial(int);

     #+END_SRC
     That's it.
** Let it SWIG
   Now will run SWIG on this input file we just wrote.
   : swig -python hello.i
   Now you should have these files
   : hello.py hello.h hello.c hello_wrap.c
   Compile your stuff
   : gcc -c hello.c hello_wrap.c -I /usr/include/python2.7 -I/usr/lib/python2.7/
   You'll be having =hello.o= and =hello_wrap.o= . It's time to link them into a shared library
   The name of the so file is module name prefixed by an underscore
   : ld -shared -o _hello.so hello.o hello_wrap.o
   Ta da! we have got our =_hello.so= ready.
** Lock and load
   - Now we have =hello.py= (generated by SWIG using hello.i)
   - We can simply =import hello= to load the module.
   - The loading of the .so file is job of hello.py
** Using Module
     #+BEGIN_SRC python
       python
       >>> import hello
       >>> hello.factorial(5)
       120
       >>>
     #+END_SRC
   - Enjoyed it! Let's do it for C++ now
** First thing first, writing the C++ code
   - We could all the above example of simple function exposing in C++ too
   - But since it is C++, We'll  do OOP by having a simple class of Point number
** The interface file
   #+BEGIN_SRC c++
     /* File : Point.h */
     
     class Point
     {
     private:
       int x;
       int y;
     public:
       Point(int,int);
       float dist_origin(); //distance from origin
     };
     
   #+END_SRC
** Implementation file for Point
   #+BEGIN_SRC c++
     /* File: Point.cpp */
     #include "Point.h"
     #include <cmath>
     Point::Point(int X, int Y)
     {
       x=X;
       y=Y;
     }
     float Point::dist_origin()
     {
       return pow(x*x + y*y, 0.5);
     }
     
   #+END_SRC
