talk2_siwg_boost/slides_other_lang.html

<div id="outline-container-3_6" class="outline-3">
<h3 id="sec-3_6"><span class="section-number-3"></span> The definition </h3>
<div class="outline-text-3" id="text-3_6">

<p>   Now we'll write the definition of our function
</p>


<pre class="src src-c"><span class="linenr"> 1:  </span><span style="color: #cd0000;">/* </span>hello.c <span style="color: #cd0000;">*/</span>
<span class="linenr"> 2:  </span><span style="color: #cd0000;">/* </span>Definition of factorial <span style="color: #cd0000;">*/</span>
<span class="linenr"> 3:  </span><span style="color: #0000ee; font-weight: bold;">#include</span> <span style="color: #00cd00;">"hello.h"</span>
<span class="linenr"> 4:  </span><span style="color: #00cd00;">int</span> <span style="color: #0000ee; font-weight: bold;">factorial</span>(<span style="color: #00cd00;">int</span> <span style="color: #cdcd00;">n</span>) {
<span class="linenr"> 5:  </span>  <span style="color: #00cdcd; font-weight: bold;">if</span> (n &lt; 0){ 
<span class="linenr"> 6:  </span>    <span style="color: #00cdcd; font-weight: bold;">return</span> 0; <span style="color: #cd0000;">// </span>Hmm, we're treating this error case
<span class="linenr"> 7:  </span>  }
<span class="linenr"> 8:  </span>  <span style="color: #00cdcd; font-weight: bold;">if</span> (n == 0) {
<span class="linenr"> 9:  </span>    <span style="color: #00cdcd; font-weight: bold;">return</span> 1;
<span class="linenr">10:  </span>  }
<span class="linenr">11:  </span>  <span style="color: #00cdcd; font-weight: bold;">else</span> {
<span class="linenr">12:  </span>    <span style="color: #00cdcd; font-weight: bold;">return</span> n * factorial(n-1);
<span class="linenr">13:  </span>  }
<span class="linenr">14:  </span>}
<span class="linenr">15:  </span>
</pre>


</div>

</div>

<div id="outline-container-3_7" class="outline-3">
<h3 id="sec-3_7"><span class="section-number-3"></span> Using in a C program </h3>
<div class="outline-text-3" id="text-3_7">

<p>   This is how the main file will use this library in your  typical C program
</p>


<pre class="src src-c"><span class="linenr">1:  </span><span style="color: #0000ee; font-weight: bold;">#include</span> <span style="color: #00cd00;">&lt;stdio.h&gt;</span>
<span class="linenr">2:  </span><span style="color: #0000ee; font-weight: bold;">#include</span> <span style="color: #00cd00;">"hello.h"</span>
<span class="linenr">3:  </span>
<span class="linenr">4:  </span><span style="color: #00cd00;">int</span> <span style="color: #0000ee; font-weight: bold;">main</span>(<span style="color: #00cd00;">void</span>)
<span class="linenr">5:  </span>{
<span class="linenr">6:  </span>  <span style="color: #00cd00;">int</span> <span style="color: #cdcd00;">a</span> = 5;
<span class="linenr">7:  </span>  printf(<span style="color: #00cd00;">"%i"</span>, factorial(a) );
<span class="linenr">8:  </span>}
</pre>


<p>
   And then you compile it with hello.c
</p><pre class="example">
gcc main.c hello.c -o hello_executable
./hello_executable
</pre>

</div>

</div>

<div id="outline-container-3_8" class="outline-3">
<h3 id="sec-3_8"><span class="section-number-3"></span> This was C, let's make it Pythonable </h3>
<div class="outline-text-3" id="text-3_8">

<ul>
<li>You will appreciate the simplicity of SWIG.
</li>
<li>Our C interface is already done.
</li>
<li>We'll just write a SWIG's .i file to expose the interface to SWIG
</li>
</ul>

</div>

</div>

<div id="outline-container-3_9" class="outline-3">
<h3 id="sec-3_9"><span class="section-number-3"></span> hello.i </h3>
<div class="outline-text-3" id="text-3_9">




<pre class="src src-c"><span style="color: #cd0000;">/* </span>File: hello.i <span style="color: #cd0000;">*/</span>
%module hello
 <span style="color: #cd0000;">/*</span>
   The following blocks are included as is in the wrapper file
   Important to include the interface file in wrapper file
   because the input file is just used for generating the wrapper code
 <span style="color: #cd0000;">*/</span>

%{
<span style="color: #0000ee; font-weight: bold;">#include</span> <span style="color: #00cd00;">"hello.h"</span>
%}
<span style="color: #cd0000;">/*</span>
  We'll now declare the interface for the wrapper file.
  At worst case, we can simply #include "hello.h" again
<span style="color: #cd0000;">*/</span>
<span style="color: #00cd00;">int</span> <span style="color: #0000ee; font-weight: bold;">factorial</span>(<span style="color: #00cd00;">int</span>);

</pre>


<p>
     That's it.
</p></div>

</div>

<div id="outline-container-3_10" class="outline-3">
<h3 id="sec-3_10"><span class="section-number-3"></span> Let it SWIG </h3>
<div class="outline-text-3" id="text-3_10">

<p>   Now will run SWIG on this input file we just wrote.
</p><pre class="example">
swig -python hello.i
</pre>

<p>   Now you should have these files
</p><pre class="example">
hello.py hello.h hello.c hello_wrap.c
</pre>

<p>   Compile your stuff
</p><pre class="example">
gcc -c hello.c hello_wrap.c -I /usr/include/python2.7 -I/usr/lib/python2.7/
</pre>

<p>   You'll be having <code>hello.o</code> and <code>hello_wrap.o</code> . It's time to link them into a shared library
   The name of the so file is module name prefixed by an underscore
</p><pre class="example">
ld -shared -o _hello.so hello.o hello_wrap.o
</pre>

<p>   Ta da! we have got our <code>_hello.so</code> ready.
</p></div>

</div>

<div id="outline-container-3_11" class="outline-3">
<h3 id="sec-3_11"><span class="section-number-3"></span> Lock and load </h3>
<div class="outline-text-3" id="text-3_11">

<ul>
<li>Now we have <code>hello.py</code> (generated by SWIG using hello.i)
</li>
<li>We can simply <code>import hello</code> to load the module.
</li>
<li>The loading of the .so file is job of hello.py
</li>
</ul>

</div>

</div>

<div id="outline-container-3_12" class="outline-3">
<h3 id="sec-3_12"><span class="section-number-3"></span> Using Module </h3>
<div class="outline-text-3" id="text-3_12">




<pre class="src src-python">python
&gt;&gt;&gt; <span style="color: #00cdcd; font-weight: bold;">import</span> hello
&gt;&gt;&gt; hello.factorial(5)
120
&gt;&gt;&gt;
</pre>


<ul>
<li>Enjoyed it! Let's do it for C++ now
</li>
</ul>

</div>

</div>

<div id="outline-container-3_13" class="outline-3">
<h3 id="sec-3_13"><span class="section-number-3"></span> First thing first, writing the C++ code </h3>
<div class="outline-text-3" id="text-3_13">

<ul>
<li>We could all the above example of simple function exposing in C++ too
</li>
<li>But since it is C++, We'll  do OOP by having a simple class of Point number
</li>
</ul>

</div>

</div>

<div id="outline-container-3_14" class="outline-3">
<h3 id="sec-3_14"><span class="section-number-3"></span> The interface file </h3>
<div class="outline-text-3" id="text-3_14">




<pre class="src src-c++"><span style="color: #cd0000;">/* </span>File : Point.h */

<span style="color: #00cdcd; font-weight: bold;">class</span> <span style="color: #00cd00;">Point</span>
{
<span style="color: #00cdcd; font-weight: bold;">private</span>:
  <span style="color: #00cd00;">int</span> <span style="color: #cdcd00;">x</span>;
  <span style="color: #00cd00;">int</span> <span style="color: #cdcd00;">y</span>;
<span style="color: #00cdcd; font-weight: bold;">public</span>:
  <span style="color: #0000ee; font-weight: bold;">Point</span>(<span style="color: #00cd00;">int</span>,<span style="color: #00cd00;">int</span>);
  <span style="color: #00cd00;">float</span> <span style="color: #0000ee; font-weight: bold;">dist_origin</span>(); <span style="color: #cd0000;">//</span>distance from origin
};

</pre>


</div>

</div>

<div id="outline-container-3_15" class="outline-3">
<h3 id="sec-3_15"><span class="section-number-3"></span> Implementation file for Point </h3>
<div class="outline-text-3" id="text-3_15">




<pre class="src src-c++"><span style="color: #cd0000;">/* </span>File: Point.cpp */
<span style="color: #0000ee; font-weight: bold;">#include</span> <span style="color: #00cd00;">"Point.h"</span>
<span style="color: #0000ee; font-weight: bold;">#include</span> <span style="color: #00cd00;">&lt;cmath&gt;</span>
<span style="color: #cd00cd;">Point</span>::<span style="color: #0000ee; font-weight: bold;">Point</span>(<span style="color: #00cd00;">int</span> <span style="color: #cdcd00;">X</span>, <span style="color: #00cd00;">int</span> <span style="color: #cdcd00;">Y</span>)
{
  x=X;
  y=Y;
}
<span style="color: #00cd00;">float</span> <span style="color: #cd00cd;">Point</span>::<span style="color: #0000ee; font-weight: bold;">dist_origin</span>()
{
  <span style="color: #00cdcd; font-weight: bold;">return</span> pow(x*x + y*y, 0.5);
}

</pre>


</div>

</div>
