talk2_siwg_boost/slides_other_lang.tex
\begin{frame}[fragile]
\frametitle{The definition}
\label{sec-3_6}

   Now we'll write the definition of our function
\begin{verbatim}
 1:  /* hello.c */
 2:  /* Definition of factorial */
 3:  #include "hello.h"
 4:  int factorial(int n) {
 5:    if (n < 0){ 
 6:      return 0; // Hmm, we're treating this error case
 7:    }
 8:    if (n == 0) {
 9:      return 1;
10:    }
11:    else {
12:      return n * factorial(n-1);
13:    }
14:  }
\end{verbatim}
\end{frame}
\begin{frame}[fragile]
\frametitle{Using in a C program}
\label{sec-3_7}

   This is how the main file will use this library in your  typical C program
\begin{verbatim}
1:  #include <stdio.h>
2:  #include "hello.h"
3:  
4:  int main(void)
5:  {
6:    int a = 5;
7:    printf("%i", factorial(a) );
8:  }
\end{verbatim}
   And then you compile it with hello.c
\begin{verbatim}
    gcc main.c hello.c -o hello_executable
    ./hello_executable
\end{verbatim}
\end{frame}
\begin{frame}
\frametitle{This was C, let's make it Pythonable}
\label{sec-3_8}


\begin{itemize}
\item You will appreciate the simplicity of SWIG.
\item Our C interface is already done.
\item We'll just write a SWIG's .i file to expose the interface to SWIG
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{hello.i}
\label{sec-3_9}

\begin{verbatim}
/* File: hello.i */
%module hello
 /*
   The following blocks are included as is in the wrapper file
   Important to include the interface file in wrapper file
   because the input file is just used for generating the wrapper code
 */

%{
#include "hello.h"
%}
/*
  We'll now declare the interface for the wrapper file.
  At worst case, we can simply #include "hello.h" again
*/
int factorial(int);
\end{verbatim}
     That's it.
\end{frame}
\begin{frame}[fragile]
\frametitle{Let it SWIG}
\label{sec-3_10}

   Now will run SWIG on this input file we just wrote.
\begin{verbatim}
    swig -python hello.i
\end{verbatim}

   Now you should have these files
\begin{verbatim}
    hello.py hello.h hello.c hello_wrap.c
\end{verbatim}

   Compile your stuff
\begin{verbatim}
    gcc -c hello.c hello_wrap.c -I /usr/include/python2.7 -I/usr/lib/python2.7/
\end{verbatim}

   You'll be having \texttt{hello.o} and \texttt{hello\_wrap.o} . It's time to link them into a shared library
   The name of the so file is module name prefixed by an underscore
\begin{verbatim}
    ld -shared -o _hello.so hello.o hello_wrap.o
\end{verbatim}

   Ta da! we have got our \texttt{\_hello.so} ready.
\end{frame}
\begin{frame}
\frametitle{Lock and load}
\label{sec-3_11}


\begin{itemize}
\item Now we have \texttt{hello.py} (generated by SWIG using hello.i)
\item We can simply \texttt{import hello} to load the module.
\item The loading of the .so file is job of hello.py
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{Using Module}
\label{sec-3_12}

\begin{verbatim}
python
>>> import hello
>>> hello.factorial(5)
120
>>>
\end{verbatim}

\begin{itemize}
\item Enjoyed it! Let's do it for C++ now
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{First thing first, writing the C++ code}
\label{sec-3_13}


\begin{itemize}
\item We could all the above example of simple function exposing in C++ too
\item But since it is C++, We'll  do OOP by having a simple class of Point number
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{The interface file}
\label{sec-3_14}

\begin{verbatim}
/* File : Point.h */

class Point
{
private:
  int x;
  int y;
public:
  Point(int,int);
  float dist_origin(); //distance from origin
};
\end{verbatim}
\end{frame}
\begin{frame}[fragile]
\frametitle{Implementation file for Point}
\label{sec-3_15}

\begin{verbatim}
/* File: Point.cpp */
#include "Point.h"
#include <cmath>
Point::Point(int X, int Y)
{
  x=X;
  y=Y;
}
float Point::dist_origin()
{
  return pow(x*x + y*y, 0.5);
}
\end{verbatim}
\end{frame}
