talk2_siwg_boost/slides_other_lang.org
** Using this Library in C++ (normally)
   #+BEGIN_SRC c++
     /* File: main.cpp */
     #include <iostream>
     #include "Point.h"
     int main()
     {
       Point p1= Point(2,3);
       std::cout << p1.dist_origin();
     }
     
   #+END_SRC
   Let's compile this, like we do it in C++
   : g++ main.cpp Point.cpp -o point_example
   : ./point_example
   
** Now time for it to be eaten by Python
   We'll write the SWIG's .i file
   #+BEGIN_SRC c++
     /* File : Point.i */
     
     %module Point // Module name
     
     %{
     #include "Point.h" //including it for  the Point_wrap.cxx file
       %}
     
     /*
       We are being lazy over here. Instead of putting the
       actual interface, we just copied it from Point.h
     ,*/
     %include "Point.h"
   #+END_SRC
   Let's quickly make the wrapper c++ file and the interface .py files using SWIG
   : swig -python -c++ Point.i
   Notice that we used =-c++= to tell SWIG that we'll be using Classes etc.
** Compiling the resultant files
   The following file are generated
   : Point_wrap.c Point_wrap.cxx Point.py
   Let's use g++ to compile our wrapper and source file
   : g++ -O2 -fPIC -c Point.cpp Point_wrap.cxx -I /usr/include/python2.7/
   Now we'll make the shared library =_Point.so= (note the naming convention is same)
   : g++ -shared -o _Point.so Point.o Point_wrap.o 
   That's it, we can start using this class in our Python code
** Run the module
   #+BEGIN_SRC python
     python
     >>> import Point
     >>> p = Point.Point(3,4)
     >>> p.dist_origin()
     5.0
   #+END_SRC
   Wasn't that simple?
** SWIG Examples
   - Global Variables
   - SWIG Directives
   - Constants
   - Pointers
   - Operator Overloading
   - Inheritance





   
   
