talk2_siwg_boost/slides_other_lang.html

<div id="outline-container-3_16" class="outline-3">
<h3 id="sec-3_16"><span class="section-number-3"></span> Using this Library in C++ (normally) </h3>
<div class="outline-text-3" id="text-3_16">




<pre class="src src-c++"><span style="color: #cd0000;">/* </span>File: main.cpp */
<span style="color: #0000ee; font-weight: bold;">#include</span> <span style="color: #00cd00;">&lt;iostream&gt;</span>
<span style="color: #0000ee; font-weight: bold;">#include</span> <span style="color: #00cd00;">"Point.h"</span>
<span style="color: #00cd00;">int</span> <span style="color: #0000ee; font-weight: bold;">main</span>()
{
  <span style="color: #00cd00;">Point</span> <span style="color: #cdcd00;">p1</span>= Point(2,3);
  <span style="color: #cd00cd;">std</span>::cout &lt;&lt; p1.dist_origin();
}

</pre>


<p>
   Let's compile this, like we do it in C++
</p><pre class="example">
g++ main.cpp Point.cpp -o point_example
./point_example
</pre>


</div>

</div>

<div id="outline-container-3_17" class="outline-3">
<h3 id="sec-3_17"><span class="section-number-3"></span> Now time for it to be eaten by Python </h3>
<div class="outline-text-3" id="text-3_17">

<p>   We'll write the SWIG's .i file
</p>


<pre class="src src-c++"><span style="color: #cd0000;">/* </span>File : Point.i */

%module Point <span style="color: #cd0000;">// </span>Module name

%{
<span style="color: #0000ee; font-weight: bold;">#include</span> <span style="color: #00cd00;">"Point.h"</span> <span style="color: #cd0000;">//</span>including it for  the Point_wrap.cxx file
  %}

<span style="color: #cd0000;">/*</span>
  We are being lazy over here. Instead of putting the
  actual interface, we just copied it from Point.h
*/
%include <span style="color: #00cd00;">"Point.h"</span>
</pre>


<p>
   Let's quickly make the wrapper c++ file and the interface .py files using SWIG
</p><pre class="example">
swig -python -c++ Point.i
</pre>

<p>   Notice that we used <code>-c++</code> to tell SWIG that we'll be using Classes etc.
</p></div>

</div>

<div id="outline-container-3_18" class="outline-3">
<h3 id="sec-3_18"><span class="section-number-3"></span> Compiling the resultant files </h3>
<div class="outline-text-3" id="text-3_18">

<p>   The following file are generated
</p><pre class="example">
Point_wrap.c Point_wrap.cxx Point.py
</pre>

<p>   Let's use g++ to compile our wrapper and source file
</p><pre class="example">
g++ -O2 -fPIC -c Point.cpp Point_wrap.cxx -I /usr/include/python2.7/
</pre>

<p>   Now we'll make the shared library <code>_Point.so</code> (note the naming convention is same)
</p><pre class="example">
g++ -shared -o _Point.so Point.o Point_wrap.o 
</pre>

<p>   That's it, we can start using this class in our Python code
</p></div>

</div>

<div id="outline-container-3_19" class="outline-3">
<h3 id="sec-3_19"><span class="section-number-3"></span> Run the module </h3>
<div class="outline-text-3" id="text-3_19">




<pre class="src src-python">python
&gt;&gt;&gt; <span style="color: #00cdcd; font-weight: bold;">import</span> Point
&gt;&gt;&gt; p = Point.Point(3,4)
&gt;&gt;&gt; p.dist_origin()
5.0
</pre>


<p>
   Wasn't that simple?
</p></div>

</div>

<div id="outline-container-3_20" class="outline-3">
<h3 id="sec-3_20"><span class="section-number-3"></span> SWIG Examples </h3>
<div class="outline-text-3" id="text-3_20">

<ul>
<li>Global Variables
</li>
<li>SWIG Directives
</li>
<li>Constants
</li>
<li>Pointers
</li>
<li>Operator Overloading
</li>
<li>Inheritance
</li>
</ul>






</div>
</div>
</div>
<div id="postamble">
<p class="date">Date: 2011-09-07 Wed</p>
<p class="author">Author: Siddhant Sanyam</p>
<p class="creator">Org version 7.5 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
