talk2_siwg_boost/slides_other_lang.tex
\begin{frame}[fragile]
\frametitle{Using this Library in C++ (normally)}
\label{sec-3_16}

\begin{verbatim}
/* File: main.cpp */
#include <iostream>
#include "Point.h"
int main()
{
  Point p1= Point(2,3);
  std::cout << p1.dist_origin();
}
\end{verbatim}
   Let's compile this, like we do it in C++
\begin{verbatim}
    g++ main.cpp Point.cpp -o point_example
    ./point_example
\end{verbatim}

   
\end{frame}
\begin{frame}[fragile]
\frametitle{Now time for it to be eaten by Python}
\label{sec-3_17}

   We'll write the SWIG's .i file
\begin{verbatim}
/* File : Point.i */

%module Point // Module name

%{
#include "Point.h" //including it for  the Point_wrap.cxx file
  %}

/*
  We are being lazy over here. Instead of putting the
  actual interface, we just copied it from Point.h
*/
%include "Point.h"
\end{verbatim}
   Let's quickly make the wrapper c++ file and the interface .py files using SWIG
\begin{verbatim}
    swig -python -c++ Point.i
\end{verbatim}

   Notice that we used \texttt{-c++} to tell SWIG that we'll be using Classes etc.
\end{frame}
\begin{frame}[fragile]
\frametitle{Compiling the resultant files}
\label{sec-3_18}

   The following file are generated
\begin{verbatim}
    Point_wrap.c Point_wrap.cxx Point.py
\end{verbatim}

   Let's use g++ to compile our wrapper and source file
\begin{verbatim}
    g++ -O2 -fPIC -c Point.cpp Point_wrap.cxx -I /usr/include/python2.7/
\end{verbatim}

   Now we'll make the shared library \texttt{\_Point.so} (note the naming convention is same)
\begin{verbatim}
    g++ -shared -o _Point.so Point.o Point_wrap.o 
\end{verbatim}

   That's it, we can start using this class in our Python code
\end{frame}
\begin{frame}[fragile]
\frametitle{Run the module}
\label{sec-3_19}

\begin{verbatim}
python
>>> import Point
>>> p = Point.Point(3,4)
>>> p.dist_origin()
5.0
\end{verbatim}
   Wasn't that simple?
\end{frame}
\begin{frame}
\frametitle{SWIG Examples}
\label{sec-3_20}


\begin{itemize}
\item Global Variables
\item SWIG Directives
\item Constants
\item Pointers
\item Operator Overloading
\item Inheritance
\end{itemize}



   
   
\end{frame}

\end{document}
